smrtkrft/SKAPP/esp32/skapp-library/sdkconfig.defaults
# SKAPP Faz 0 starter defaults.
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# USB Serial/JTAG carries the boot log (and the CLI once sk_transport_usb is wired).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_USB_SERIAL_JTAG_ENABLED=y
CONFIG_ESP_CONSOLE_HISTORY_BUFFER_SIZE=2048

# Bootloader rollback enabled — required by sk_ota when added.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# TLS certificate bundle — required by sk_api outbound HTTPS to verify
# popular CA roots (Let's Encrypt, GoDaddy, etc.) without per-endpoint
# cert config. Telegram, IFTTT and most modern APIs work out of the box.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# NVS without encryption — fine for dev boards; enable on production.
CONFIG_NVS_ENCRYPTION=n

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
